#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-south-1:508656221602:cluster/ecs-runner-cluster]
aws_secretsmanager_secret.AWS_ACCESS_KEY_ID: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu]
aws_eip.nat_gateway_eip: Refreshing state... [id=eipalloc-0e7fc431ff5a103e9]
aws_secretsmanager_secret.ORG: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u]
aws_ecr_repository.ECR_repository: Refreshing state... [id=ecs-runner]
aws_secretsmanager_secret.REPO: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht]
aws_cloudwatch_log_group.ecs-log-group: Refreshing state... [id=/ecs/ecs-runner-task-def]
aws_vpc.vpc: Refreshing state... [id=vpc-07498bf92e0c86bd9]
aws_secretsmanager_secret.AWS_DEFAULT_REGION: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc]
aws_secretsmanager_secret.AWS_SECRET_ACCESS_KEY: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-runner_ecs_task_execution_role]
aws_secretsmanager_secret.PAT: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt]
aws_secretsmanager_secret_version.ORG_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u|81D91F79-F921-4AFC-A404-AFB834498594]
aws_secretsmanager_secret_version.AWS_SECRET_ACCESS_KEY_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht|6A6D9D94-1BC0-470F-9380-B0E8ABE0F5D5]
aws_secretsmanager_secret_version.AWS_DEFAULT_REGION_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc|82B59D96-9E50-4ABE-B34B-931684C50975]
aws_secretsmanager_secret_version.AWS_ACCESS_KEY_ID_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu|047A56A8-0D9F-448E-92DD-DEF7D23515A0]
aws_secretsmanager_secret_version.REPO_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht|4793C5A2-A49B-40AA-817B-AFE71973AAD5]
aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=ecs-runner_ecs_task_execution_role:password-policy-secretsmanager]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744423200000001]
aws_iam_role_policy_attachment.admin-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744458800000002]
aws_secretsmanager_secret_version.PAT_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt|6D8BD3FA-D748-4C1F-B0A7-CD0B087B2ED1]
aws_ecs_task_definition.task_definition: Refreshing state... [id=ecs-runner-task-def]
aws_internet_gateway.int_gateway: Refreshing state... [id=igw-01c1b694a42658781]
aws_security_group.ecs_sg: Refreshing state... [id=sg-0393461826a5b8a29]
aws_route_table.route_table_public: Refreshing state... [id=rtb-063216b5f5f2501f8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.dev_to_cpu will be created
  + resource "aws_appautoscaling_policy" "dev_to_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev-to-cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/ecs-runner-cluster/ecs-runner-ecs-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.dev_to_memory will be created
  + resource "aws_appautoscaling_policy" "dev_to_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev-to-memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/ecs-runner-cluster/ecs-runner-ecs-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.dev_to_target will be created
  + resource "aws_appautoscaling_target" "dev_to_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/ecs-runner-cluster/ecs-runner-ecs-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-south-1:508656221602:cluster/ecs-runner-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ecs-runner-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0393461826a5b8a29",
            ]
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:ap-south-1:508656221602:task-definition/ecs-runner-task-def:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-south-1:508656221602:task-definition/ecs-runner-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment      = [] -> null
                  ~ image            = "747632300909.dkr.ecr.ap-northeast-1.amazonaws.com/ecs-runner:latest" -> "508656221602.dkr.ecr.ap-south-1.amazonaws.com/ecs-runner:latest"
                  - mountPoints      = [] -> null
                    name             = "ecs-runner"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 80 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "ecs-runner-task-def" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_nat_gateway.nat_gateway will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id                      = "eipalloc-0e7fc431ff5a103e9"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "ecs-runner_nat_gateway"
        }
      + tags_all                           = {
          + "Name" = "ecs-runner_nat_gateway"
        }
    }

  # aws_route_table.route_table_private will be created
  + resource "aws_route_table" "route_table_private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "ecs-runner_private"
        }
      + tags_all         = {
          + "Name" = "ecs-runner_private"
        }
      + vpc_id           = "vpc-07498bf92e0c86bd9"
    }

  # aws_route_table_association.assoc_1 will be created
  + resource "aws_route_table_association" "assoc_1" {
      + id             = (known after apply)
      + route_table_id = "rtb-063216b5f5f2501f8"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.assoc_2 will be created
  + resource "aws_route_table_association" "assoc_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private_subnet will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "20.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ecs-runner_private_subnet"
        }
      + tags_all                                       = {
          + "Name" = "ecs-runner_private_subnet"
        }
      + vpc_id                                         = "vpc-07498bf92e0c86bd9"
    }

  # aws_subnet.public_subnet will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "20.0.255.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ecs-runner_public_subnet"
        }
      + tags_all                                       = {
          + "Name" = "ecs-runner_public_subnet"
        }
      + vpc_id                                         = "vpc-07498bf92e0c86bd9"
    }

Plan: 11 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @pkj1993, Action: `pull_request`*